package main

import "gostart/base/chatper_15/utils"

/*
1.E-mail
^\w+([-+.]\w+)＊@\w+([-.]\w+)＊\.\w+([-.]\w+)＊$

2.URL
^(https?:\/\/)?([\da-z.-]+)\.([a-z.]{2,6})([\/\w .-])\/?$

3.匹配首尾空白字符的正则表达式
^\s|\s$

4.手机号
^(13[0-9]|14[0-9]|15[0-9]|166|17[0-9]|18[0-9]|19[8|9])\d{8}$

5.18位身份证号码（数字、字母x结尾）
^((\d{18})|([0-9x]{18})|([0-9X]{18}))$

6.账号是否合法（5～16字节，允许字母、数字、下划线，以字母开头）
^[a-zA-Z][a-zA-Z0-9_]{4,15}$

7.一年的12个月（01～09和1～12）
^(0?[1-9]|1[0-2])$

8.日期格式（2018-01-01只做粗略匹配，格式不限制，二月有30天等）
^\d{4}-\d{1,2}-\d{1,2}$

9.IP地址
^(([0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])\.){3}([0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])$

*/

func main() {
	utils.Demo1()
	utils.Demo2()
	utils.Demo3()
	utils.Demo4()

}
